In [21]:
import pandas as pd

In [22]:
import pandas as pd

# 판다스(Pandas)

# 1. 시리즈(Series)

In [23]:
import pandas as pd
# pandas.함수() 

# 하루 방문자 수 데이터 
visitors = pd.Series(
    data=[120, 150, 130, 170, 160],
    name = "방문자 수" # 옵션
)

print(visitors)

0    120
1    150
2    130
3    170
4    160
Name: 방문자 수, dtype: int64

In [24]:
# 속성
print(visitors.index)   # 인덱스 추출
print(visitors.values)  # 값 추출
print(visitors.dtype)   # 데이터 타입
print(visitors.name)    # 시리즈 이름
print(visitors.size)    # 데이터 개수

RangeIndex(start=0, stop=5, step=1)
[120 150 130 170 160]
int64
방문자 수
5

## 1) 생성 및 조회

<table>
    <thead>
        <tr>
            <th>이름</th><th>나이</th><th>키</th>
        </tr>
    </thead>
    <tbody>
        <tr><td>김영철</td><td>24</td><td>179.4</td></tr>
        <tr><td>송윤지</td><td>31</td><td>161.0</td></tr>
        <tr><td>임수현</td><td>26</td><td>174</td></tr>
    </tbody>
</table>

In [25]:
# 위의 표를 리스트/딕셔너리로 바꿔보세요.

### (1) 데이터만 생성

In [26]:
# 이름 열을 시리즈로 만들기
name_data = pd.Series(
    data=["김영철", "송윤지", "임수현"],
    name="이름" 
)

print(name_data)

0    김영철
1    송윤지
2    임수현
Name: 이름, dtype: object

In [27]:
# 나이 열을 시리즈로 만들기
age_data = pd.Series(
    data=[24, 31, 26],
    name="나이" 
)

print(age_data)

0    24
1    31
2    26
Name: 나이, dtype: int64

### (2) 인덱스와 함께 생성

In [28]:
print(age_data)
age_data.index = ["김영철", "송윤지", "임수현"]
print(age_data)

0    24
1    31
2    26
Name: 나이, dtype: int64
김영철    24
송윤지    31
임수현    26
Name: 나이, dtype: int64

In [29]:
age_data2 = pd.Series(
    data=[24, 31, 26],
    name="나이" ,
    index=["김영철", "송윤지", "임수현"]
)

print(age_data2)

김영철    24
송윤지    31
임수현    26
Name: 나이, dtype: int64

In [30]:
age_data3 = pd.Series(
    data={"김영철": 24, "송윤지": 31, "임수현": 26},
    name="나이"
)
print(age_data3)

김영철    24
송윤지    31
임수현    26
Name: 나이, dtype: int64

## 2) 연산

In [31]:
# 데이터가 1, 2, 3인 시리즈 생성
data1 = pd.Series([1, 2, 3])
print(data1)

# 데이터가 10, 20, 30인 시리즈 생성 
data2 = pd.Series([10, 20, 30])
print(data2)

# 데이터가 10, 20, 30인 시리즈 생성 
data3 = pd.Series([10, 20, 30], index=[2, 1, 0])
print(data3)

0    1
1    2
2    3
dtype: int64
0    10
1    20
2    30
dtype: int64
2    10
1    20
0    30
dtype: int64

In [32]:
# 시리즈는 같은 인덱스끼리 연산된다.
print(data1 + data2)
print("="*30)
print(data1 + data3)

0    11
1    22
2    33
dtype: int64
==============================
0    31
1    22
2    13
dtype: int64

In [33]:
# 데이터가 서울, 부산, 대구인 시리즈 생성
data4 = pd.Series(["서울", "부산", "대구"])

# 데이터가 관악구, 수영구, 달서구인 시리즈 생성
data5 = pd.Series(["관악구", "수영구", "달서구"]) 

print(data4 + data5)

0    서울관악구
1    부산수영구
2    대구달서구
dtype: object

In [34]:
# int 시리즈, str 시리즈 
# 서울1, 부산2, 대구3 이렇게 할 수 있을까?
data4 = pd.Series(["서울", "부산", "대구"])
data1 = pd.Series([1, 2, 3])
print(data4.dtype)
print(data1.dtype)

object
int64

In [35]:
# print(data4 + data1)

In [36]:
# data4.dtype - object, data1.dtype - str
data1_obj = data1.astype("str")
data1_obj = data1.astype(str)
print(data1_obj)

print(data4 + data1_obj)

0    1
1    2
2    3
dtype: object
0    서울1
1    부산2
2    대구3
dtype: object

## 3) 결측치

### (1) 결측치 발생

In [37]:
import numpy as np 
import pandas as pd 

data = pd.Series([1, 2, np.nan, 4])
print(data)

0    1.0
1    2.0
2    NaN
3    4.0
dtype: float64

예제
* 데이터가 10, 20, 30인 시리즈 생성, 인덱스는 부산, 울산, 대구으로 설정
* 데이터가 1, 2, 3, 4인 시리즈 생성, 인덱스는 광주, 부산, 울산, 대구으로 설정
* 데이터의 덧셈

In [38]:
data1 = pd.Series(
    data=[10, 20, 30],
    index=["부산", "울산", "대구"]
)
print(data1)

data2 = pd.Series(
    data=[1, 2, 3, 4],
    index=["광주", "부산", "울산", "대구"]
)
print(data2)

부산    10
울산    20
대구    30
dtype: int64
광주    1
부산    2
울산    3
대구    4
dtype: int64

In [39]:
# 매칭이 되지 않는 인덱스 데이터는 결측값이 된다.
print(data1 + data2)

광주     NaN
대구    34.0
부산    12.0
울산    23.0
dtype: float64

### (2) 결측치 파악

In [40]:
total = data1 + data2
print(total)

광주     NaN
대구    34.0
부산    12.0
울산    23.0
dtype: float64

In [41]:
# 데이터 정보 확인하기 
total.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 광주 to 울산
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      float64
dtypes: float64(1)
memory usage: 64.0+ bytes

In [42]:
# 각 셀마다 결측치인지 아닌지 판단하기 
total.isna()

광주     True
대구    False
부산    False
울산    False
dtype: bool

In [43]:
# 결측치가 몇 개인가요?(bool - True(1), False(0))
print(total.isna().sum())

1

### (3) 결측치 채우기

In [44]:
print(total)

광주     NaN
대구    34.0
부산    12.0
울산    23.0
dtype: float64

In [45]:
# 결측치를 0으로 채워주세요.
print(total.fillna(0)) # total 덮어씌워지지 않는다.

광주     0.0
대구    34.0
부산    12.0
울산    23.0
dtype: float64

### (4) 결측치 삭제

In [46]:
print(total)

광주     NaN
대구    34.0
부산    12.0
울산    23.0
dtype: float64

In [47]:
# 결측치를 제거해주세요.
print(total.dropna()) # total 덮어씌워지지 않는다.

대구    34.0
부산    12.0
울산    23.0
dtype: float64

In [48]:
print(total)

광주     NaN
대구    34.0
부산    12.0
울산    23.0
dtype: float64

## 4) 통계

In [49]:
data = pd.Series(
    data=[17, 25, 33],
    index=["부산", "울산", "대구"]
)
print(data)

부산    17
울산    25
대구    33
dtype: int64

In [50]:
print(data.sum())   # 열의 합
print(data.mean())  # 열 평균
print(data.min())   # 최솟값
print(data.max())   # 최댓값
print(data.std())   # 표준편차
print(data.var())   # 분산

75
25.0
17
33
8.0
64.0

In [51]:
print(data.describe())

count     3.0
mean     25.0
std       8.0
min      17.0
25%      21.0
50%      25.0
75%      29.0
max      33.0
dtype: float64

예제. 문자 데이터

```
['HR', 'Engineering', 'HR', 'Engineering', 'HR', 'Marketing', 'Engineering', 'Marketing', 'HR']
```

In [52]:
import pandas as pd 

data_list = ['HR', 'Engineering', 'HR', 'Engineering', 'HR', 'Marketing', 'Engineering', 'Marketing', 'HR']

data = pd.Series(data=data_list)
print(data)

0             HR
1    Engineering
2             HR
3    Engineering
4             HR
5      Marketing
6    Engineering
7      Marketing
8             HR
dtype: object

In [53]:
print(data.describe())

count      9
unique     3
top       HR
freq       4
dtype: object

# 2. 데이터프레임(DataFrame)

## 1) 생성

<table>
    <thead>
        <tr>
            <th>이름</th><th>성별</th><th>나이</th><th>키</th>
        </tr>
    </thead>
    <tbody>
        <tr><td>김영철</td><th>M</th><td>24</td><td>179.4</td></tr>
        <tr><td>송윤지</td><th>F</th><td>31</td><td>161.0</td></tr>
        <tr><td>임수현</td><th>F</th><td>26</td><td>174</td></tr>
    </tbody>
</table>

In [54]:
# 데이터를 리스트로 표현
data_list = [
    ["김영철", "M", 24, 179.4],
    ["송윤지", "F", 31, 161.0],
    ["임수현", "F", 26, 179]
]

In [55]:
import pandas as pd

df = pd.DataFrame(
    data=data_list,
    columns=["이름", "성별", "나이", "키"]
)
df

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  179.0

In [56]:
df = pd.DataFrame(data=data_list)
df.columns = ["이름", "성별", "나이", "키"]
df

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  179.0

In [57]:
# 데이터의 열을 딕셔너리로 표현
data_col_dict = {
   "이름": ["김영철", "송윤지", "임수현"],
   "성별": ["M", "F", "F"],
   "나이": [24, 31, 26],
   "키": [179.4, 161.0, 174]
}

In [58]:
df = pd.DataFrame(data=data_col_dict)
df

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [59]:
# 데이터의 행을 딕셔너리/리스트로 표현 (JSON) ⭐ 표현 기억해두기
data_row_list = [
    {"이름": "김영철", "성별": "M", "나이": 24, "키": 179.4},
    {"이름": "송윤지", "성별": "F", "나이": 31, "키": 161.0},
    {"이름": "임수현", "성별": "F", "나이": 26, "키": 174}
]

In [60]:
df = pd.DataFrame(data=data_row_list)
df

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [61]:
# 이름을 인덱스로 하고 싶어요. 
df_name_idx = df.set_index("이름") # df에 덮어씌워지지 않는다. 
df_name_idx

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

In [62]:
# 인덱스를 없애고 싶어요. 
df_name_idx.reset_index() # df_name_idx에 덮어씌워지지 않는다.

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

## 2) 조회 ⭐

In [63]:
df

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [64]:
df_name_idx

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

### (1) 이름으로 조회

#### 열 조회(`df[열이름], df.loc[:,열이름]`)

In [65]:
# df에서 "나이"열만 가져오고 싶어요
df["나이"]

0    24
1    31
2    26
Name: 나이, dtype: int64

In [66]:
# 콜론(:)이 의미하는 것은 전체를 다 가져와라 
# df에서 "나이"열만 가져오고 싶어요
df.loc[   :   ,   "나이" ]  # 시리즈

0    24
1    31
2    26
Name: 나이, dtype: int64

In [67]:
# 콜론(:)이 의미하는 것은 전체를 다 가져와라 
# df에서 "나이"열만 가져오고 싶어요
df.loc[   :   ,   ["나이"] ] # 데이터프레임

   나이
0  24
1  31
2  26

In [68]:
# df에서 이름, 키 열만 가져오고 싶어요.
df[["이름", "키"]]

    이름      키
0  김영철  179.4
1  송윤지  161.0
2  임수현  174.0

In [69]:
# df에서 이름, 키 열만 가져오고 싶어요.
df.loc[   :    ,    ["이름", "키"]    ]

    이름      키
0  김영철  179.4
1  송윤지  161.0
2  임수현  174.0

#### 행 조회(`df.loc[인덱스이름]`)

In [70]:
# df에서 송윤지 데이터를 가지고 오고 싶어요. 
df.loc[    1     ,    :     ] # 시리즈

이름      송윤지
성별        F
나이       31
키     161.0
Name: 1, dtype: object

In [71]:
# df에서 송윤지 데이터를 가지고 오고 싶어요. 
df.loc[    [1]     ,    :     ] # 데이터프레임

    이름 성별  나이      키
1  송윤지  F  31  161.0

In [72]:
# df_name_idx에서 송윤지 데이터를 가지고 오고 싶어요. 
df_name_idx.loc[   "송윤지"     ,    :    ] # 시리즈

성별        F
나이       31
키     161.0
Name: 송윤지, dtype: object

In [73]:
# df_name_idx에서 송윤지 데이터를 가지고 오고 싶어요. 
df_name_idx.loc[   ["송윤지"]     ,    :    ] # 데이터프레임

    성별  나이      키
이름
송윤지  F  31  161.0

In [74]:
# df에서 김영철, 임수현의 데이터를 가지고 오고 싶어요.
df.loc[  [0, 2]    ,   :   ]

    이름 성별  나이      키
0  김영철  M  24  179.4
2  임수현  F  26  174.0

In [75]:
# df_name_idx에서 김영철, 임수현의 데이터를 가지고 오고 싶어요.
df_name_idx.loc[ ["김영철", "임수현"], : ]

    성별  나이      키
이름
김영철  M  24  179.4
임수현  F  26  174.0

#### 셀 조회(`df.loc[인덱스이름,열이름]`)

In [76]:
# df에서 김영철 학생의 키를 출력하고 싶어요. 
df.loc[  0   ,   "키"  ]

np.float64(179.4)

In [77]:
# df에서 송윤지, 임수현의 성별을 출력하고 싶어요. 
df.loc[    [1, 2]    ,   "성별"      ]

1    F
2    F
Name: 성별, dtype: object

In [78]:
# df_name_idx에서 임수현 학생의 나이를 출력하고 싶어요.
df_name_idx.loc[  "임수현"     ,   "나이"     ]

np.int64(26)

In [79]:
# df_name_idx에서 송윤지의 성별, 키를 출력하고 싶어요. 
df_name_idx.loc[    "송윤지",     ["성별", "키"]           ]

성별        F
키     161.0
Name: 송윤지, dtype: object

In [80]:
# df에서 김영철, 송윤지의 이름, 나이를 출력하고 싶어요.
df.loc[     [0, 1]         ,     ["이름", "나이"]        ]

    이름  나이
0  김영철  24
1  송윤지  31

### (2) 인덱스로 조회

In [81]:
df.index = [2, 1, 0]
df

    이름 성별  나이      키
2  김영철  M  24  179.4
1  송윤지  F  31  161.0
0  임수현  F  26  174.0

In [82]:
df_name_idx

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

#### 열 조회(`df.iloc[:,열위치]`)

In [83]:
# df에서 나이열을 출력하고 싶어요. 
# [이름, 성별, 나이, 키]
# 나이 : 2번째 요소
df.iloc[    :    ,    2     ] # 시리즈

2    24
1    31
0    26
Name: 나이, dtype: int64

In [84]:
df.iloc[    :    ,    [2]     ] # 데이터프레임

   나이
2  24
1  31
0  26

In [85]:
# df에서 키 열을 출력하고 싶어요.
# [이름, 성별, 나이, 키]
# 나이 : 3번째 요소, -1번째 요소
df.iloc[    :      ,    -1     ]

2    179.4
1    161.0
0    174.0
Name: 키, dtype: float64

In [86]:
# df에서 이름, 성별, 나이 열을 출력하고 싶어요. 
# [이름, 성별, 나이, 키]
# [이름, 성별, 나이] -> 0:3 (0번째부터 3번째 앞까지)
df.iloc[    :     ,   0:3     ]

    이름 성별  나이
2  김영철  M  24
1  송윤지  F  31
0  임수현  F  26

#### 행 조회(`df.iloc[인덱스위치,:]`)

In [87]:
# df에서 임수현의 데이터를 출력하고 싶어요. 
# [2, 1, 0]
# 임수현은 2번째 요소에 있다. 
df.iloc[   2     ,    :     ]

이름      임수현
성별        F
나이       26
키     174.0
Name: 0, dtype: object

In [88]:
# df에서 김영철, 송윤지의 데이터를 출력하고 싶어요.
# [2, 1, 0]
# [김영철, 송윤지] -> 0번째에서 2번째 앞까지 
df.iloc[   :2      ,    :    ]

    이름 성별  나이      키
2  김영철  M  24  179.4
1  송윤지  F  31  161.0

#### 셀 조회(`df.iloc[인덱스위치, 열위치]`)

In [89]:
# df에서 임수현의 나이를 출력하고 싶어요. 
# 인덱스 위치: 2번째
# 열 위치: 2번째
df.iloc[   2    ,   2    ]

np.int64(26)

In [90]:
# df에서 송윤지의 이름, 성별을 출력하고 싶어요. 
# 인덱스 위치: 1번째
# 열 위치: 0번째부터 2번째 앞까지 
df.iloc[   1    ,   0:2    ]

이름    송윤지
성별      F
Name: 1, dtype: object

In [91]:
# df에서 김영철, 송윤지의 성별, 나이를 출력하고 싶어요.
# 인덱스 위치: 0번째부터 2번째 앞까지
# 열 위치: 1번째부터 3번째 앞까지
df.iloc[   0:2    ,  1:3     ]

  성별  나이
2  M  24
1  F  31

### (3) 조건부 조회

In [92]:
# df.loc[ 인덱스 이름 , 열 이름 ]
# df.iloc[ 인덱스 위치 , 열 위치 ]
# 데이터 하나는 행 하나를 의미하기 때문에 조건은 인덱스 자리에 작성한다.

In [93]:
# 성별이 M인 데이터 조회
# 성별 추출 : df["성별"]
df.loc[  df["성별"]=="M"  ,  : ]

    이름 성별  나이      키
2  김영철  M  24  179.4

In [94]:
# 키가 170이 넘는 사람 조회
# 키 추출: df["키"]
# 조건: df["키"] > 170
df.loc[ df["키"] > 170 , :]

    이름 성별  나이      키
2  김영철  M  24  179.4
0  임수현  F  26  174.0

In [95]:
## startswith() / endswith()
text = "송윤지"
# 조건: 맨 앞에 "송"이 있는가?
print(text.startswith("송"))
# 조겅: 맨 뒤에 "송"이 있는가?
print(text.endswith("송"))

True
False

In [96]:
# 이름이 "송"씨인 사람 조회
# 이름 추출: df["이름"], 
# 조건: df["이름"].str.startswith("송")
# (Hint: startswith())
df.loc[ df["이름"].str.startswith("송") , :]

    이름 성별  나이      키
1  송윤지  F  31  161.0

In [97]:
# 이름에 "수"가 있는 사람만 조회 
# 이름 추출: df["이름"], 
# 조건: df["이름"].str.contains("송")
# (Hint: startswith())
df.loc[ df["이름"].str.contains("수") , :]

    이름 성별  나이      키
0  임수현  F  26  174.0

In [98]:
# 20대인 사람만 조회
# 나이 추출: df["나이"]
# 조건: df["나이"] >= 20, df["나이"] <30
# 조건 결합: AND(&)
df.loc[  (df["나이"] >= 20) & (df["나이"] <30) , :]

    이름 성별  나이      키
2  김영철  M  24  179.4
0  임수현  F  26  174.0

In [99]:
# 여자이거나 키가 170cm 이상인 사람만 조회
# 성별 추출, 키 추출 : df["성별"], df["키"]
# 조건: df["성별"] == "F", df["키"] >= 170
# 조건 결합: OR(|)
df.loc[ (df["성별"] == "F") | (df["키"] >= 170)  , :]

    이름 성별  나이      키
2  김영철  M  24  179.4
1  송윤지  F  31  161.0
0  임수현  F  26  174.0

## 3) 편집

In [100]:
df

    이름 성별  나이      키
2  김영철  M  24  179.4
1  송윤지  F  31  161.0
0  임수현  F  26  174.0

### (1) 인덱스 제거

In [101]:
# 인덱스를 현재 데이터프레임에 맞춰서 위치로 이름짓고 싶다.
df.reset_index(drop=True)

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

### (2) 데이터 병합

In [102]:
data1 = pd.DataFrame(
    data=[["강남", 1, 2], ["서초", 4, 5], ["노원", 5, 6]],
    columns=["지역명", "지점수", "매출"]
)
data1

  지역명  지점수  매출
0  강남    1   2
1  서초    4   5
2  노원    5   6

In [103]:
data2 = pd.DataFrame(
    data=[["강남", 10, 20], ["도봉", 40, 50], ["노원", 50, 60]],
    columns=["지역명", "지점수", "매출"]
)
data2

  지역명  지점수  매출
0  강남   10  20
1  도봉   40  50
2  노원   50  60

In [104]:
data3 = pd.DataFrame(
    data=[["강남", 10, 20], ["도봉", 40, 50], ["노원", 50, 60]],
    columns=["지역명", "방문자수", "직원 수"]
)
data3

  지역명  방문자수  직원 수
0  강남    10    20
1  도봉    40    50
2  노원    50    60

In [105]:
# data1 + data2 
# 이 결과가 우리가 원하는 것일까?
data1 + data2

    지역명  지점수  매출
0  강남강남   11  22
1  서초도봉   44  55
2  노원노원   55  66

In [106]:
# 문제: 똑같은 테이블이 2개가 작성되어 있다.
# 의도: 지역별로 겹치는 것만 지점수, 매출을 합산하고 싶다. 
# 인덱스를 지역명으로 바꿔야 합니다. 
data1_loc_idx = data1.set_index("지역명")
data1_loc_idx

     지점수  매출
지역명
강남     1   2
서초     4   5
노원     5   6

In [107]:
data2_loc_idx = data2.set_index("지역명")
data2_loc_idx

     지점수  매출
지역명
강남    10  20
도봉    40  50
노원    50  60

In [108]:
data1_loc_idx + data2_loc_idx

      지점수    매출
지역명
강남   11.0  22.0
노원   55.0  66.0
도봉    NaN   NaN
서초    NaN   NaN

In [109]:
# 문제: 지역별로 새로운 열이 추가되었다. 
# 의도: 지역별로 지점수, 매출, 방문자수, 직원수를 합치고 싶다.

In [110]:
# pd.merge()
total_data = pd.merge(
    left=data1,
    right=data3,
    how="outer",  # left, right, inner, outer
    on="지역명" # 누구를 기준으로
)
total_data

  지역명  지점수   매출  방문자수  직원 수
0  강남  1.0  2.0  10.0  20.0
1  노원  5.0  6.0  50.0  60.0
2  도봉  NaN  NaN  40.0  50.0
3  서초  4.0  5.0   NaN   NaN

In [111]:
# how: 가져올 on(=지역명)
## left: data1의 지역명에 맞춰서
## right: data3의 지역명에 맞춰서
## inner: data1, data3에 모두 있는 지역명에 맞춰서
## outer: data1, data3에 있는 모든 지역명에 맞춰서

### (3) 결측치 처리

In [112]:
total_data

  지역명  지점수   매출  방문자수  직원 수
0  강남  1.0  2.0  10.0  20.0
1  노원  5.0  6.0  50.0  60.0
2  도봉  NaN  NaN  40.0  50.0
3  서초  4.0  5.0   NaN   NaN

In [113]:
# 결측치 정보를 확인
total_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지역명     4 non-null      object
 1   지점수     3 non-null      float64
 2   매출      3 non-null      float64
 3   방문자수    3 non-null      float64
 4   직원 수    3 non-null      float64
dtypes: float64(4), object(1)
memory usage: 292.0+ bytes

In [114]:
# 결측치 개수 구하기
## 결측치인지 판단하기
total_data.isna() # 각 셀마다 결측인지 아닌지를 True/False 판단

     지역명    지점수     매출   방문자수   직원 수
0  False  False  False  False  False
1  False  False  False  False  False
2  False   True   True  False  False
3  False  False  False   True   True

In [115]:
total_data.isna().sum(axis=0)

지역명     0
지점수     1
매출      1
방문자수    1
직원 수    1
dtype: int64

In [116]:
total_data.isna().sum(axis=1)

0    0
1    0
2    2
3    2
dtype: int64

In [117]:
# 결측치 처리
total_data

  지역명  지점수   매출  방문자수  직원 수
0  강남  1.0  2.0  10.0  20.0
1  노원  5.0  6.0  50.0  60.0
2  도봉  NaN  NaN  40.0  50.0
3  서초  4.0  5.0   NaN   NaN

In [118]:
## 결측치 채우기
total_data.fillna(999)

  지역명    지점수     매출   방문자수   직원 수
0  강남    1.0    2.0   10.0   20.0
1  노원    5.0    6.0   50.0   60.0
2  도봉  999.0  999.0   40.0   50.0
3  서초    4.0    5.0  999.0  999.0

In [119]:
## 결측치 제거
total_data.dropna()

  지역명  지점수   매출  방문자수  직원 수
0  강남  1.0  2.0  10.0  20.0
1  노원  5.0  6.0  50.0  60.0

## 4) 통계

In [120]:
total_data.describe()

            지점수        매출       방문자수       직원 수
count  3.000000  3.000000   3.000000   3.000000
mean   3.333333  4.333333  33.333333  43.333333
std    2.081666  2.081666  20.816660  20.816660
min    1.000000  2.000000  10.000000  20.000000
25%    2.500000  3.500000  25.000000  35.000000
50%    4.000000  5.000000  40.000000  50.000000
75%    4.500000  5.500000  45.000000  55.000000
max    5.000000  6.000000  50.000000  60.000000

# 3. 실습

In [121]:
# cdata.csv
# cdata_nohead.csv
# mpg.csv 
# kr3_raw.tsv
# 국민건강보험공단.......xlsx

## 예제 1. # cdata.csv 불러오기

In [122]:
# cdata.csv
df = pd.read_csv(
    "./data/cdata.csv",
    encoding="CP949", # 한글 경우에는 utf-8, CP949
    index_col=0 # 인덱스로 지정할 열
)
df

   Index   No  Age City
0      1  홍길동   25   서울
1      2  김준기   21   서울
2      9  이명식   22   부산
3     32  방준혁   24   광주
4     47  최명기   31   부산

## 예제 2. cdata_nohead.csv 불러오기

In [123]:
# cdata_nohead.csv
df = pd.read_csv(
    "./data/cdata_nohead.csv",
    header=None,
    names=["index", "no", "이름", "나이", "지역"],
    index_col="index"
)
df

       no   이름  나이  지역
index
0       1  홍길동  25  서울
1       2  김준기  21  서울
2       9  이명식  22  부산
3      32  방준혁  24  광주
4      47  최명기  31  부산

## 예제 3. kr3_raw.tsv 불러오기

In [124]:
df = pd.read_csv(
    "./data/kr3_raw.tsv", # 탭으로 구분
    sep="\t"
)
df.head() # 뷰어: 위에서 5개만

  Region  Rating  Category                                             Review
0    인덕원       1   삼겹살 고기집  숙성 돼지고기 전문점입니다. 건물 모양 때문에 매장 모양도 좀 특이하지만 쾌적한 편...
1    인덕원       1   삼겹살 고기집  고기가 정말 맛있었어요! 육즙이 가득있어서 너무 좋았아요\n일하시는분들 너무 친절하...
2    인덕원       1  순대국 찹쌀순대  잡내없고 깔끔, 담백한 맛의 순대국이 순대국을 안 좋아하는 사람들에게도 술술 넘어갈...
3    인덕원       1  순대국 찹쌀순대  고기 양이 푸짐해서 특 순대국밥을 시킨 기분이 듭니다~~ 맛도 좋습니다\n다만 양념...
4    인덕원       1  순대국 찹쌀순대  순대국 자체는 제가 먹어본 순대국밥집 중에서 Top5 안에는 들어요.\n\n그러나 ...

In [125]:
df.head(3)

  Region  Rating  Category                                             Review
0    인덕원       1   삼겹살 고기집  숙성 돼지고기 전문점입니다. 건물 모양 때문에 매장 모양도 좀 특이하지만 쾌적한 편...
1    인덕원       1   삼겹살 고기집  고기가 정말 맛있었어요! 육즙이 가득있어서 너무 좋았아요\n일하시는분들 너무 친절하...
2    인덕원       1  순대국 찹쌀순대  잡내없고 깔끔, 담백한 맛의 순대국이 순대국을 안 좋아하는 사람들에게도 술술 넘어갈...

In [126]:
df.tail() # 뷰어: 뒤에서 5개만

,Region,Rating,Category,Review
642408,평택,2,일식/중식/세계음식,"요즘, 핫하게,,,떠오르구 있는 중국집. ㅋ, 맥주의 여파루 속이 안좋지만 와봄. ..."
642409,평택,0,한식,원래 글 안쓰는데 이거는 정말 다른분들 위해서 써야할것같네요 방금 포장주문 해서 왔...
642410,평택,1,한식,"우리팀 단골집, 술먹고 다음 날 가면 푸짐하게 배불리 해장 할 수 있는곳, 주말도 ..."
642411,평택,2,카페/디저트,"원래는 평택에 있었는데, 연남동에도 최근에 생겨서 방문 했는데..진짜 줄이 어마어마..."
642412,평택,2,한식,친구들의 추천으로 가보게 된 곳. 안성과 평택 몇군데 위주로 체인점이 있는 소규모 ...

## 예제 3. 자동차 회사의연비 데이터

* manufacturer : 회사명
* cty : 도심연비
* hwy : 고속도로 연비

In [127]:
# 범주형 
# - 카테고리 종류 / 개수 
# df[범주형변수].unique() - 어떤 종류가 있나요?
# df[범주형변수].nunique() - 몇 종류인가요?
# - 범주형 별로 데이터 개수 세기
# df[범주형변수].value_counts()
# df.value_counts(subset=[범주형변수])

## 데이터 불러오기

In [128]:
# mpg.csv
df = pd.read_csv(
    "./data/mpg.csv"
)
df.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

## 데이터 파악하기

In [129]:
# 데이터 정보 확인하기 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234 entries, 0 to 233
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  category      234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 20.2+ KB

In [130]:
# 결측치가 있는지 확인
df.isnull().sum()

manufacturer    0
model           0
displ           0
year            0
cyl             0
trans           0
drv             0
cty             0
hwy             0
fl              0
category        0
dtype: int64

In [131]:
# 데이터의 통계 정보 
df.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

## Q1. 몇 개의 회사가 있나요?

In [132]:
# * manufacturer : 회사명
# * cty : 도심연비
# * hwy : 고속도로 연비

In [133]:
df.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [134]:
df.info() # 우리 눈으로 확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234 entries, 0 to 233
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  category      234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 20.2+ KB

In [135]:
df.shape # 튜플

(234, 11)

In [136]:
print(f"{df.shape[0]}개의 데이터가 있습니다.")

234개의 데이터가 있습니다.

In [137]:
print(f"{len(df)}개의 데이터가 있습니다.")

234개의 데이터가 있습니다.

In [138]:
df.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [139]:
# 회사는 총 몇 개의 종류인가?
# 필요한 열: manufacturer
print(df["manufacturer"].unique())

['audi' 'chevrolet' 'dodge' 'ford' 'honda' 'hyundai' 'jeep' 'land rover'
 'lincoln' 'mercury' 'nissan' 'pontiac' 'subaru' 'toyota' 'volkswagen']

In [140]:
print(df["manufacturer"].nunique())

15

## Q2. 회사별로 참여한 자동차가 몇 대인지 파악하세요.

In [141]:
df

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [142]:
df["manufacturer"].value_counts()

manufacturer
dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
hyundai       14
subaru        14
nissan        13
honda          9
jeep           8
pontiac        5
land rover     4
mercury        4
lincoln        3
Name: count, dtype: int64

In [143]:
# manufacturer이 honda인 데이터는 몇 개입니까?
df["manufacturer"].value_counts()["honda"]

np.int64(9)

## Q3. 도심연비와 고속도로 연비를 평균낸 total 연비를 구하세요

In [144]:
# manufacturer : 회사명
# cty : 도심연비
# hwy : 고속도로 연비
# 새로운 열 'total' = (cty + hwy) / 2
df["total"] = (df["cty"] + df["hwy"]) / 2
df.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0

## Q4. total 연비 상위 10개 회사의 회사별 개수를 구하세요

In [145]:
df.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0

In [146]:
# 정렬: sort_values()
df_total_top10 = df.sort_values(by=["total"], ascending=False).iloc[0:10, :]
df_total_top10

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,39.5
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,38.5
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,35.0
196,toyota,corolla,1.8,2008,4,manual(m5),f,28,37,r,compact,32.5
197,toyota,corolla,1.8,2008,4,auto(l4),f,26,35,r,compact,30.5
195,toyota,corolla,1.8,1999,4,manual(m5),f,26,35,r,compact,30.5
99,honda,civic,1.6,1999,4,manual(m5),f,28,33,r,subcompact,30.5
105,honda,civic,1.8,2008,4,auto(l5),f,25,36,r,subcompact,30.5
104,honda,civic,1.8,2008,4,manual(m5),f,26,34,r,subcompact,30.0
106,honda,civic,1.8,2008,4,auto(l5),f,24,36,c,subcompact,30.0

In [147]:
df_total_top10["manufacturer"].value_counts()

manufacturer
honda         4
volkswagen    3
toyota        3
Name: count, dtype: int64

## +Quiz. 현대자동차의 total 연비에 대한 평균값은?

In [148]:
df["manufacturer"].unique()

array(['audi', 'chevrolet', 'dodge', 'ford', 'honda', 'hyundai', 'jeep',
       'land rover', 'lincoln', 'mercury', 'nissan', 'pontiac', 'subaru',
       'toyota', 'volkswagen'], dtype=object)

In [149]:
# 현대자동차는 df에 뭐라고 표현되어 있을까? - hyundai
# df에서 manufacturer이 "hyundai"만 추출 - df_hd
# df_hd에서 total 열의 평균을 구해야 한다.
df_hd = df.loc[ df["manufacturer"] == "hyundai" , :]
df_hd["total"].mean()

np.float64(22.75)

## Q5. total 연비의 평균보다 높은 자동차는 PASS, 낮은 자동차는 FAIL로 구분하세요.

In [150]:
df.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0

In [151]:
total_mean = df["total"].mean()
print(total_mean)

20.14957264957265

In [152]:
# 새로운 열 result : total > total_mean -> True or False 가 저장된다. 
df["result"] = (df["total"] > total_mean)
df.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,result
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,True
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,True
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,True
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,True
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,True

In [153]:
# result가 True인 것만 추출
df.loc[ df["result"] == False , :]

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,result
11,audi,a4 quattro,2.8,1999,6,auto(l5),4,15,25,p,compact,20.0,False
14,audi,a4 quattro,3.1,2008,6,manual(m6),4,15,25,p,compact,20.0,False
15,audi,a6 quattro,2.8,1999,6,auto(l5),4,15,24,p,midsize,19.5,False
17,audi,a6 quattro,4.2,2008,8,auto(s6),4,16,23,p,midsize,19.5,False
18,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,14,20,r,suv,17.0,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
203,toyota,toyota tacoma 4wd,3.4,1999,6,manual(m5),4,15,17,r,pickup,16.0,False
204,toyota,toyota tacoma 4wd,3.4,1999,6,auto(l4),4,15,19,r,pickup,17.0,False
205,toyota,toyota tacoma 4wd,4.0,2008,6,manual(m6),4,15,18,r,pickup,16.5,False
206,toyota,toyota tacoma 4wd,4.0,2008,6,auto(l5),4,16,20,r,pickup,18.0,False
219,volkswagen,jetta,2.8,1999,6,auto(l4),f,16,23,r,compact,19.5,False

In [154]:
df["result"] = df["result"].replace({True: "pass", False: "fail"})
df.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,result
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,pass
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,pass
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,pass
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,pass
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,pass

In [155]:
import numpy as np 

df["result"] = np.where(df["total"] > total_mean, "pass", "fail")
df.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,result
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,pass
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,pass
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,pass
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,pass
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,pass

In [156]:
# apply() : 시리즈의 하나 하나 데이터마다 함수를 적용시킨다. 
# list comprehension : 한줄 코드
# df["total"] 데이터 요소 하나하나를 x라는 변수라고 하자. 
# 만약에 x > total_mean , pass, 아니면 fail
# new_total = []
# if x > total_mean:
#     new_total.append("pass")
# else:
#     new_total.append("fail")

# 한줄코드: ["pass" if x > total_mean else "fail" for x in df['total']]d

In [157]:
df["result"] = df["total"].apply(lambda x: "pass" if x > total_mean else "fail")
df.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,result
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,pass
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,pass
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,pass
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,pass
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,pass

In [158]:
# 새로운 열 : 조건이 있다. 
# 1) True/False 열을 만들고, replace 로 대체
# 2) np.where() 바로 만드는 방법
# 3) df.apply() 만드는 방법

## +Quiz. PASS인 자동차 중 가장 많은 숫자의 자동차 회사는?

In [159]:
df.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,result
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,pass
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,pass
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,pass
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,pass
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,pass

In [160]:
# df에서 result가 pass인 데이터를 추출하자. df_pass
# df_pass에서 manufacturer 변수의 종류별 개수, value_counts()
df_pass = df.loc[ df["result"] == "pass" , :  ]
df_pass

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,result
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,pass
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,pass
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,pass
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,pass
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,pass
...,...,...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5,pass
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0,pass
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0,pass
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0,pass
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5,pass

In [161]:
df_pass["manufacturer"].value_counts()

manufacturer
volkswagen    26
toyota        19
audi          14
subaru        14
hyundai       13
honda          9
nissan         9
chevrolet      7
pontiac        5
dodge          4
ford           3
Name: count, dtype: int64